{"Author":"Cicero7800","CacheStatus":0,"Description":"<p>A series of interactive tutorials for learning and practicing build orders. Includes 20 scenarios, each with step-by-step instructions in both text and audio, and a scoring system that will mark you at several benchmarks leading to a final grade (A+ to F). Credits and thanks to ZeroEmpires for voicing these scenarios.<br /><br /><strong>Installation &amp; Troubleshooting:</strong><br />- Go to the mod section ingame and search for this mod (If you have already installed the mod and it isn't working, uninstall it. You could also open the mod directory at this point to check that the mod is completely removed.)<br />- Install the mod <u>and wait until the mod has finished downloading.</u><br />- Restart the game. Note that whilst the sound files have always required a restart, this is now required for the scenario text as well. This also goes for every time the game unchecks all your mods after an update...<br /><br /><strong>How to Play:</strong><br />- Single Player: Skirmish<br />- Game Mode: Custom Scenario &amp;C################### NOT change the player colour!<br /><br /><strong>How to Play on a New Map:</strong><br />- Single Player: Editor &amp; Choose Scenario<br />- On the Map tab: Tick Random Map<br />- Choose the corresponding map: Build Order Arabia/Arena/Island<br />- [Change Map Size to Tiny]<br />- Click Generate<br />- Map Menu: Test<br /><br /><strong>Build Orders Included:</strong><br />BASIC<br />- 22 pop Scouts<br />- 23 pop Archers<br />- 28+2 Knights<br />- 27+2 Boom<br />ARABIA<br />- 21 pop Scouts<br />- 21 pop Scouts - Skirms<br />- 21 pop Scouts - Archers<br />- 22 pop Archers<br />- 22 pop Men-at-Arms*<br />- 28 pop Drush - Archers<br />- 32+2 Drush - FC<br />CHINESE<br />- 23 pop Scouts*<br />- 24 pop Archers*<br />WATER<br />- 26 pop Full Water*<br />- 26 pop Hybrid*<br />ARENA<br />- 25+2 3TC Boom*<br />- 27+2 4TC Boom*<br />- 27+2 Scouts + Monks*<br />- 26+2 Castle Drop*<br />- Turks Fast Imp*<br /><br />*Be aware that the audio for these builds is currently incomplete. Until I can get these voiced, I suggest checking the written versions of the builds below. Example videos will also have to wait till audio is added.<br /><br />Please check https://buildorderreference.com for written versions, benchmark timings, FAQ and troubleshooting.</p>","Title":"Interactive Build Order Guide"}